---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRail.Length
zh: 长度
source: html/f954aaf8-c2e9-6a54-0d0a-b9dc067b1856.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail.Length Property

**中文**: 长度

The length of the rail.

## Syntax (C#)
```csharp
public double Length { get; }
```